## Pandas
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrames. Series is a 1-D array like object, while DataFrame is a 2-D heterogeneous tabular data structure (like excel rows and columns).

#### Importing Pandas

In [2]:
# importing pandas
import pandas as pd

#### Series

In [3]:
# Series 
data=[1,2,3,4,5]

# Series from list
series_from_list=pd.Series(data)
series_from_list

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
# Series from Dictionary
dictionary_data={'a':1,'b':2,'c':3}
series_from_dictionary=pd.Series(dictionary_data)
series_from_dictionary

a    1
b    2
c    3
dtype: int64

In [6]:
# Dictionary Seris from merging 2 lists
data=['adi','han','bheltu']
index=[1,2,3]
new_series=pd.Series(data,index=index)
new_series

1       adi
2       han
3    bheltu
dtype: object

#### DataFrames

In [7]:
# DataFrames

# Creating a DataFrame from dicitonary of list
data={
    'name':['adi','han','bheltu','chomesh','htrt3'],
    'age':[20,19,23,21,27],
    'city':['Mumbai','Kolkata','Madrid','Zagreb','Naihati']
}
df=pd.DataFrame(data)
df

      name  age     city
0      adi   20   Mumbai
1      han   19  Kolkata
2   bheltu   23   Madrid
3  chomesh   21   Zagreb
4    htrt3   27  Naihati

In [8]:
# Creating a DataFrame from list of Dictionaries
data=[
    {'name':'adi','age':20,'city':'mumbai'},
    {'name':'han','age':19,'city':'kolkata'},
    {'name':'bheltu','age':23,'city':'madrid'},
    {'name':'chomesh','age':21,'city':'zagreb'},
    {'name':'htrt3','age':27,'city':'naihati'},
]
df=pd.DataFrame(data)
df

      name  age     city
0      adi   20   mumbai
1      han   19  kolkata
2   bheltu   23   madrid
3  chomesh   21   zagreb
4    htrt3   27  naihati

In [11]:
# Acessing elements in a DatFrame
df.loc[0]

name       adi
age         20
city    mumbai
Name: 0, dtype: object

In [12]:
df.iloc[0]

name       adi
age         20
city    mumbai
Name: 0, dtype: object

In [14]:
df.iloc[1][2]

/var/folders/5x/8lgxf25n21j4dtm6mpf28s0r0000gn/T/ipykernel_2613/65333983.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][2]

'kolkata'

In [15]:
# Accessing a specific element using at
df.at[2,'city']

'madrid'

In [16]:
df.at[0,'name']

'adi'

In [17]:
# Accessing a specific element using iat
df.iat[0,0]

'adi'

In [18]:
df.iat[2,1]

np.int64(23)

In [28]:
# Adding a column
print(df)

df['Salary']=[1000,2340,970,1300,20383]
print(df)

      name  age     city
0      adi   20   mumbai
1      han   19  kolkata
2   bheltu   23   madrid
3  chomesh   21   zagreb
4    htrt3   27  naihati
      name  age     city  Salary
0      adi   20   mumbai    1000
1      han   19  kolkata    2340
2   bheltu   23   madrid     970
3  chomesh   21   zagreb    1300
4    htrt3   27  naihati   20383

In [29]:
# Removing a Column
df.drop('Salary',axis=1,inplace=True)
df

      name  age     city
0      adi   20   mumbai
1      han   19  kolkata
2   bheltu   23   madrid
3  chomesh   21   zagreb
4    htrt3   27  naihati

In [30]:
# Add 1 to each age in the column
df['age']=df['age']+1
df

      name  age     city
0      adi   21   mumbai
1      han   20  kolkata
2   bheltu   24   madrid
3  chomesh   22   zagreb
4    htrt3   28  naihati

#### Importing a csv file

In [10]:
# importing a csv file
orders=pd.read_csv('Orders.csv')
orders.head()

  Order ID  Order Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore